#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	// регистр ВКМ_ВыполненныеСотрудникомРаботы
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧаса КАК СтоимостьЧаса
		|ПОМЕСТИТЬ ВТ_СтоимостьЧаса
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СтоимостьЧаса.СтоимостьЧаса КАК СтоимостьЧаса,
		|	ЕСТЬNULL(ВКМ_СведенияОСотрудникахСрезПоследних.ПроцентЗаВыполненныеРаботы, 0) КАК ПроцентЗаВыполненныеРаботы,
		|	ЕСТЬNULL(ВКМ_СведенияОСотрудникахСрезПоследних.НулевойПроцент, 0) КАК НулевойПроцент
		|ИЗ
		|	ВТ_СтоимостьЧаса КАК ВТ_СтоимостьЧаса
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_СведенияОСотрудниках.СрезПоследних(&Дата, Сотрудник = &Специалист) КАК
		|			ВКМ_СведенияОСотрудникахСрезПоследних
		|		ПО ИСТИНА";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Специалист", Специалист);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтоимостьЧаса = Выборка.СтоимостьЧаса;
		НулевойПроцент = Выборка.НулевойПроцент;
		ПроцентЗаВыполненныеРаботы = Выборка.ПроцентЗаВыполненныеРаботы;
		
		Если ПроцентЗаВыполненныеРаботы = 0 Тогда
			Если НулевойПроцент = 0 ИЛИ НулевойПроцент = Ложь Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтрШаблон("Сотруднику %1 не установлен процент за выполненные работы", Специалист);
				Сообщение.Сообщить();
				
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
		
		// регистр ВКМ_ВыполненныеКлиентуРаботы
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = СтоимостьЧаса * Движение.КоличествоЧасов;
		
		// регистр ВКМ_ВыполненныеСотрудникомРаботы
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Движение.ЧасовКОплате * СтоимостьЧаса* ПроцентЗаВыполненныеРаботы / 100;
		
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти
