
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.Адрес;
	ОтпускаСотрудников.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
	
	ДиограммаГанта.Очистить();
	ДиограммаГанта.Обновление = Ложь;
	
	Для Каждого Строка из ОтпускаСотрудников Цикл
		
		ТочкаДиограммы = ДиограммаГанта.УстановитьТочку(Строка.Сотрудник);
		ТочкаДиограммы.Текст = Строка.Сотрудник;
		СерияДиограммы = ДиограммаГанта.УстановитьСерию("Отпуск");
		СерияДиограммы.Текст = "Отпуск";
		
		Значение = ДиограммаГанта.ПолучитьЗначение(ТочкаДиограммы, СерияДиограммы);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;
	
	ДиограммаГанта.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти