// ++Диплом Купцов А.В. 16.05.2025
// Добавлена проверка заполнения добавленных реквизитов
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		ПроверяемыеРеквизиты.Добавить("ВКМ_ДатаНачалаДействияДоговора");
		ПроверяемыеРеквизиты.Добавить("ВКМ_ДатаОкончанияДействияДоговора");
		ПроверяемыеРеквизиты.Добавить("ВКМ_СуммаАбонентскойПлаты");
		ПроверяемыеРеквизиты.Добавить("ВКМ_СтоимостьЧаса");
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
// --Диплом Купцов А.В. 16.05.2025